import * as echarts from 'echarts';

var chartDom = document.getElementById('main');
var myChart = echarts.init(chartDom);
var option;

stations = [
  '4309胶带顺槽水仓处',
  '4309工作面回风',
  '4309胶带顺槽二部皮带机头处',
  '4309胶带顺槽排水处',
  '4309工作面回风隅角',
  '4309工作面',
  '4309轨道顺槽2号超高处',
  '4309轨道顺槽1号超高处',
  '4307轨道运输巷卸压施工处',
  '西翼-700矸石仓顶溜头机电设备处',
  '西翼-700煤仓顶机电设备处',
  '4312胶带运输巷机尾机电设备处',
  '4310胶带运输巷超高处',
  '4310切眼回风',
  '4310切眼施工处',
  '4310胶带顺槽（新）卸压施工处',
  '4310胶带顺槽（新）皮带机头机电设备处',
  '4310胶带顺槽回风',
  '4310胶带顺槽施工处',
  '4310胶带顺槽机电设备处',
  '4310胶带顺槽1号超高处',
  '4310胶带运输巷溜头机电设备处',
  '4310轨道顺槽联络巷超高处',
  '4310轨道顺槽施工处',
  '4310轨道顺槽排水处',
  '4310轨道串联风',
  '4306轨道运输巷回风',
  '4306轨道运输巷排水及施工处'
];
stations.reverse();
stations_data = [
  '4309胶带顺槽水仓处',
  '4309工作面回风',
  '4309胶带顺槽二部皮带机头处',
  '4309胶带顺槽排水处',
  '4309工作面回风隅角',
  '4309工作面',
  '4309轨道顺槽2号超高处',
  '4309轨道顺槽1号超高处',
  '4307轨道运输巷卸压施工处',
  '西翼-700矸石仓顶溜头机电设备处',
  '西翼-700煤仓顶机电设备处',
  '4312胶带运输巷机尾机电设备处',
  '4310胶带运输巷超高处',
  '4310切眼回风',
  '4310切眼施工处',
  '4310胶带顺槽（新）卸压施工处',
  '4310胶带顺槽（新）皮带机头机电设备处',
  '4310胶带顺槽回风',
  '4310胶带顺槽施工处',
  '4310胶带顺槽机电设备处',
  '4310胶带顺槽1号超高处',
  '4310胶带运输巷溜头机电设备处',
  '4310轨道顺槽联络巷超高处',
  '4310轨道顺槽施工处',
  '4310轨道顺槽排水处',
  '4310轨道串联风',
  '4306轨道运输巷回风',
  '4306轨道运输巷排水及施工处',
  '4309工作面回风',
  '4309工作面回风隅角',
  '4309工作面',
  '4310切眼回风',
  '4310切眼施工处',
  '4310轨道串联风'
];

stations_time = [
  '2022-10-24 22:00',
  '2022-10-24 23:00',
  '2022-10-25 0:00',
  '2022-10-25 1:00',
  '2022-10-25 2:00',
  '2022-10-25 3:00',
  '2022-10-25 4:00',
  '2022-10-25 5:00',
  '2022-10-25 6:00',
  '2022-10-25 7:00'
];
stations_time_data = [
  '2022-10-24 23:56',
  '2022-10-25 00:02',
  '2022-10-25 00:09',
  '2022-10-25 00:16',
  '2022-10-25 00:22',
  '2022-10-25 00:30',
  '2022-10-25 00:38',
  '2022-10-25 00:44',
  '2022-10-25 00:50',
  '2022-10-25 00:59',
  '2022-10-25 01:05',
  '2022-10-25 01:13',
  '2022-10-25 01:20',
  '2022-10-25 01:26',
  '2022-10-25 01:37',
  '2022-10-25 01:45',
  '2022-10-25 01:54',
  '2022-10-25 02:00',
  '2022-10-25 02:08',
  '2022-10-25 02:15',
  '2022-10-25 02:21',
  '2022-10-25 02:28',
  '2022-10-25 02:34',
  '2022-10-25 02:41',
  '2022-10-25 02:47',
  '2022-10-25 02:53',
  '2022-10-25 03:00',
  '2022-10-25 03:06',
  '2022-10-25 04:11',
  '2022-10-25 04:23',
  '2022-10-25 04:31',
  '2022-10-25 05:15',
  '2022-10-25 05:26',
  '2022-10-25 06:06'
];

test_data = [
["2022-10-24 23:56","4309胶带顺槽水仓处"],
["2022-10-25 00:02","4309工作面回风"],
["2022-10-25 00:09","4309胶带顺槽二部皮带机头处"],
["2022-10-25 00:16","4309胶带顺槽排水处"],
["2022-10-25 00:22","4309工作面回风隅角"],
["2022-10-25 00:30","4309工作面"],
["2022-10-25 00:38","4309轨道顺槽2号超高处"],
["2022-10-25 00:44","4309轨道顺槽1号超高处"],
["2022-10-25 00:50","4307轨道运输巷卸压施工处"],
["2022-10-25 00:59","西翼-700矸石仓顶溜头机电设备处"],
["2022-10-25 01:05","西翼-700煤仓顶机电设备处"],
["2022-10-25 01:13","4312胶带运输巷机尾机电设备处"],
["2022-10-25 01:20","4310胶带运输巷超高处"],
["2022-10-25 01:26","4310切眼回风"],
["2022-10-25 01:37","4310切眼施工处"],
["2022-10-25 01:45","4310胶带顺槽（新）卸压施工处"],
["2022-10-25 01:54","4310胶带顺槽（新）皮带机头机电设备处"],
["2022-10-25 02:00","4310胶带顺槽回风"],
["2022-10-25 02:08","4310胶带顺槽施工处"],
["2022-10-25 02:15","4310胶带顺槽机电设备处"],
["2022-10-25 02:21","4310胶带顺槽1号超高处"],
["2022-10-25 02:28","4310胶带运输巷溜头机电设备处"],
["2022-10-25 02:34","4310轨道顺槽联络巷超高处"],
["2022-10-25 02:41","4310轨道顺槽施工处"],
["2022-10-25 02:47","4310轨道顺槽排水处"],
["2022-10-25 02:53","4310轨道串联风"],
["2022-10-25 03:00","4306轨道运输巷回风"],
["2022-10-25 03:06","4306轨道运输巷排水及施工处"],
["2022-10-25 04:11","4309工作面回风"],
["2022-10-25 04:23","4309工作面回风隅角"],
["2022-10-25 04:31","4309工作面"],
["2022-10-25 05:15","4310切眼回风"],
["2022-10-25 05:26","4310切眼施工处"],
["2022-10-25 06:06","4310轨道串联风"],


["2022-10-25 8:02","4309胶带顺槽水仓处",],
["2022-10-25 8:08","4309工作面回风",],
["2022-10-25 8:14","4309胶带顺槽二部皮带机头处",],
["2022-10-25 8:20","4309胶带顺槽排水处",],
["2022-10-25 8:26","4309工作面回风隅角",],
["2022-10-25 8:33","4309工作面",],
["2022-10-25 8:40","4309轨道顺槽2号超高处",],
["2022-10-25 8:46","4309轨道顺槽1号超高处",],
["2022-10-25 8:52","4307轨道运输巷卸压施工处",],
["2022-10-25 8:59","西翼-700矸石仓顶溜头机电设备处",],
["2022-10-25 9:05","西翼-700煤仓顶机电设备处",],
["2022-10-25 9:11","4312胶带运输巷机尾机电设备处",],
["2022-10-25 9:18","4310胶带运输巷超高处",],
["2022-10-25 9:24","4310切眼回风",],
["2022-10-25 9:35","4310切眼施工处",],
["2022-10-25 9:41","4310胶带顺槽（新）卸压施工处",],
["2022-10-25 9:48","4310胶带顺槽（新）皮带机头机电设备处",],
["2022-10-25 9:54","4310胶带顺槽回风",],
["2022-10-25 10:01","4310胶带顺槽施工处",],
["2022-10-25 10:07","4310胶带顺槽机电设备处",],
["2022-10-25 10:13","4310胶带顺槽1号超高处",],
["2022-10-25 10:19","4310胶带运输巷溜头机电设备处",],
["2022-10-25 10:25","4310轨道顺槽联络巷超高处",],
["2022-10-25 10:31","4310轨道顺槽施工处",],
["2022-10-25 10:37","4310轨道顺槽排水处",],
["2022-10-25 10:43","4310轨道串联风",],
["2022-10-25 10:49","4306轨道运输巷回风",],
["2022-10-25 10:55","4306轨道运输巷排水及施工处",],

["2022-10-25 12:43","4309工作面回风"],
["2022-10-25 12:51","4309工作面回风隅角"],
["2022-10-25 12:59","4309工作面"],
["2022-10-25 13:16","4310切眼回风"],
["2022-10-25 13:26","4310切眼施工处"],
["2022-10-25 14:10","4310轨道串联风"],




["2022-10-25 16:07",'4309胶带顺槽水仓处'],
["2022-10-25 16:13",  '4309工作面回风'],
["2022-10-25 16:19",  '4309胶带顺槽二部皮带机头处'],
["2022-10-25 16:25",  '4309胶带顺槽排水处'],
["2022-10-25 16:31",  '4309工作面回风隅角'],
["2022-10-25 16:38",  '4309工作面'],
["2022-10-25 16:45",  '4309轨道顺槽2号超高处'],
["2022-10-25 16:51",  '4309轨道顺槽1号超高处'],
["2022-10-25 16:57",  '4307轨道运输巷卸压施工处'],
["2022-10-25 17:07",  '西翼-700矸石仓顶溜头机电设备处'],
["2022-10-25 17:13",  '西翼-700煤仓顶机电设备处'],
["2022-10-25 17:20",  '4312胶带运输巷机尾机电设备处'],
["2022-10-25 17:26",  '4310胶带运输巷超高处'],
["2022-10-25 17:32",  '4310切眼回风'],
["2022-10-25 17:41",  '4310切眼施工处'],
["2022-10-25 17:49",  '4310胶带顺槽（新）卸压施工处'],
["2022-10-25 17:57",  '4310胶带顺槽（新）皮带机头机电设备处'],
["2022-10-25 18:03",  '4310胶带顺槽回风'],
["2022-10-25 18:10",  '4310胶带顺槽施工处'],
["2022-10-25 18:16",  '4310胶带顺槽机电设备处'],
["2022-10-25 18:22",  '4310胶带顺槽1号超高处'],
["2022-10-25 18:28",  '4310胶带运输巷溜头机电设备处'],
["2022-10-25 18:34",  '4310轨道顺槽联络巷超高处'],
["2022-10-25 18:41",  '4310轨道顺槽施工处'],
["2022-10-25 18:47",  '4310轨道顺槽排水处'],
["2022-10-25 18:53",  '4310轨道串联风'],
["2022-10-25 18:59",  '4306轨道运输巷回风'],
["2022-10-25 19:05",  '4306轨道运输巷排水及施工处'],


["2022-10-25 20:37","4309工作面回风"],
["2022-10-25 20:46","4309工作面回风隅角"],
["2022-10-25 20:54","4309工作面"],
["2022-10-25 21:13","4310切眼回风"],
["2022-10-25 21:25","4310切眼施工处"],
["2022-10-25 22:05","4310轨道串联风"],


  ];

option = {
  title: {
    text: '巡回路线图',
    subtext: '2022年10月18日',
    show: false
  },
  tooltip: {
    show: true,
    trigger: 'axis',
    formatter: '{c}'
  },
  grid: {
    left: '50',
    right: '20',
    bottom: '0',
    top: '0',
    containLabel: true,
    show: true,
    borderWidth: 1
  },
  xAxis: {
    type: 'time',
    data: stations_time,
    axisLabel: {
      showMinLabel: true,
      align: 'center'
    },
    axisTick: {
      lineStyle: {
        type: 'solid'
      },
      inside: true,
      show: true,
      length: 1000
    },
    axisLine: {
      onZero: false,
      show: true
    },
    offset: 0,
    boundaryGap: true,
    min: '2022-10-24 23:00',
    max: '2022-10-25 07:00',
    splitNumber: 8
  },
  yAxis: {
    offset: 260,
    axisLine: { onZero: false },
    axisLabel: {
      formatter: '{value}',
      align: 'left',
      margin: -5
    },
    axisTick: {
      inside: true,
      lineStyle: {
        type: 'solid'
      },
      length: 932
    },
    type: 'category',
    data: stations
  },
  series: [
    {
      type: 'line',
      name: 'data',
      data: test_data
    }
  ]
};

option && myChart.setOption(option);
